; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph11 - mode
	spectrograph1 - mode
	image10 - mode
	spectrograph7 - mode
	spectrograph2 - mode
	thermograph5 - mode
	thermograph3 - mode
	infrared0 - mode
	image4 - mode
	spectrograph9 - mode
	image8 - mode
	image6 - mode
	Star0 - direction
	Star1 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Star5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 image6)
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph9)
	(supports instrument0 image8)
	(supports instrument0 image4)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph5)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph7)
	(supports instrument0 image10)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph11)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
)
(:goal (and
	(have_image Star5 spectrograph2)
	(have_image Star5 thermograph3)
	(have_image Phenomenon6 thermograph5)
	(have_image Phenomenon6 spectrograph7)
	(have_image Star7 infrared0)
	(have_image Star7 image10)
	(have_image Star8 image10)
	(have_image Star8 thermograph5)
	(have_image Star8 spectrograph9)
	(have_image Star9 spectrograph9)
))

)

; plan
1. (turn_to satellite0 groundstation2 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 10
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 10
3. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 0 of 10
4. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 10
5. (take_image satellite0 star9 instrument0 spectrograph9)
   added: (have_image star9 spectrograph9)
   goals met: 1 of 10
6. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 1 of 10
7. (take_image satellite0 star5 instrument0 thermograph3)
   added: (have_image star5 thermograph3)
   goals met: 2 of 10
8. (take_image satellite0 star5 instrument0 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon6 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 10
10. (take_image satellite0 phenomenon6 instrument0 thermograph5)
   added: (have_image phenomenon6 thermograph5)
   goals met: 4 of 10
11. (take_image satellite0 phenomenon6 instrument0 spectrograph7)
   added: (have_image phenomenon6 spectrograph7)
   goals met: 5 of 10
12. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 5 of 10
13. (take_image satellite0 star7 instrument0 image10)
   added: (have_image star7 image10)
   goals met: 6 of 10
14. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 7 of 10
15. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 7 of 10
16. (take_image satellite0 star8 instrument0 image10)
   added: (have_image star8 image10)
   goals met: 8 of 10
17. (take_image satellite0 star8 instrument0 spectrograph9)
   added: (have_image star8 spectrograph9)
   goals met: 9 of 10
18. (take_image satellite0 star8 instrument0 thermograph5)
   added: (have_image star8 thermograph5)
   goals met: 10 of 10
